
@craigbowden76 i tried running same terraform config using v1.10.0 first then upgraded to v1.15.0 but not run into any issue

```

myTestPC:issue658 chinthalapalli$ terraform init

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of f5networks/bigip from the dependency lock file
- Using previously-installed f5networks/bigip v1.10.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

myTestPC:issue658 chinthalapalli$ terraform -version
Terraform v1.1.8
on darwin_amd64
+ provider registry.terraform.io/f5networks/bigip v1.10.0

Your version of Terraform is out of date! The latest version
is 1.2.5. You can update by downloading from https://www.terraform.io/downloads.html


myTestPC:issue658 chinthalapalli$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_as3.application will be created
  + resource "bigip_as3" "application" {
      + application_list = (known after apply)
      + as3_json         = jsonencode(
            {
              + action      = "deploy"
              + class       = "AS3"
              + declaration = {
                  + Common        = {
                      + Shared = {
                          + class       = "Application"
                          + serviceMain = {
                              + class            = "Service_HTTP"
                              + pool             = "web_pool"
                              + virtualAddresses = [
                                  + "10.0.2.10",
                                ]
                            }
                          + template    = "shared"
                          + web_pool    = {
                              + class    = "Pool"
                              + members  = [
                                  + {
                                      + serverAddresses = [
                                          + "192.0.1.100",
                                          + "192.0.1.110",
                                        ]
                                      + servicePort     = 80
                                    },
                                ]
                              + monitors = [
                                  + "http",
                                ]
                            }
                        }
                      + class  = "Tenant"
                    }
                  + class         = "ADC"
                  + id            = "example-declaration-01"
                  + label         = "Sample 1"
                  + remark        = "Simple HTTP application with round robin pool"
                  + schemaVersion = "3.0.0"
                }
              + persist     = true
            }
        )
      + id               = (known after apply)
      + ignore_metadata  = false
      + tenant_filter    = "Common"
      + tenant_list      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_as3.application: Creating...
bigip_as3.application: Still creating... [10s elapsed]
bigip_as3.application: Still creating... [20s elapsed]
bigip_as3.application: Creation complete after 24s [id=Common]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.



myTestPC:issue658 chinthalapalli$ terraform apply
bigip_as3.application: Refreshing state... [id=Common]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.


myTestPC:issue658 chinthalapalli$ terraform init -upgrade

Initializing the backend...

Initializing provider plugins...
- Finding f5networks/bigip versions matching "1.15.0"...
- Installing f5networks/bigip v1.15.0...
- Installed f5networks/bigip v1.15.0 (signed by a HashiCorp partner, key ID 0F284A6527D73A63)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
myTestPC:issue658 chinthalapalli$ 
myTestPC:issue658 chinthalapalli$ 
myTestPC:issue658 chinthalapalli$ 

myTestPC:issue658 chinthalapalli$ terraform -version
Terraform v1.1.8
on darwin_amd64
+ provider registry.terraform.io/f5networks/bigip v1.10.0

Your version of Terraform is out of date! The latest version
is 1.2.5. You can update by downloading from https://www.terraform.io/downloads.html


myTestPC:issue658 chinthalapalli$ terraform apply
bigip_as3.application: Refreshing state... [id=Common]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
myTestPC:issue658 chinthalapalli$ 
myTestPC:issue658 chinthalapalli$ 
myTestPC:issue658 chinthalapalli$ 
myTestPC:issue658 chinthalapalli$ terraform apply
bigip_as3.application: Refreshing state... [id=Common]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # bigip_as3.application will be updated in-place
  ~ resource "bigip_as3" "application" {
      ~ as3_json         = jsonencode(
          ~ {
              ~ declaration = {
                  ~ Common        = {
                      ~ Shared = {
                          ~ serviceMain = {
                              ~ virtualAddresses = [
                                  - "10.0.2.10",
                                  + "10.0.3.10",
                                ]
                                # (2 unchanged elements hidden)
                            }
                            # (3 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    }
                    id            = "example-declaration-01"
                    # (4 unchanged elements hidden)
                }
                # (3 unchanged elements hidden)
            }
        )
        id               = "Common"
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_as3.application: Modifying... [id=Common]
bigip_as3.application: Still modifying... [id=Common, 10s elapsed]
bigip_as3.application: Modifications complete after 15s [id=Common]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```